{
    "projects": [
        {
            "name": "PHP forum",
            "descriptionFr": "Premier développement web, avec intégration d'un forum. Le site a fonctionné pendant plus de deux ans avant que je ne décide de le fermer. Il a été principalement utilisé comme plateforme de chat pour ma classe pendant mes deux années de BTS.",
            "descriptionEn": "First web development, with integration of a forum. The site operated for more than two years before I decided to close it. It was mainly used as a chat platform for my class during my two years of BTS.",
            "technos": [
                "PHP",
                "MySQL"
            ],
            "experience": "Personal",
            "date": "2015"
        },
        {
            "name": "Raspberry server",
            "descriptionFr": "Infrastructure de serveur basée sur Raspberry que j'ai mis en place à la maison pour héberger mon site web et un certain nombre d'autres services. La plupart de ces démons sont toujours en cours d'exécution après 4 ans même si j'ai décidé d'en supprimer certains (comme la stack mail), ou de remplacer certains services par des équivalents (remplacement du serveur Apache2 par un serveur Nginx).",
            "descriptionEn": "Server infrastructure based on Raspberry that I set up at home to host my website and a number of other services. Most of these demons are still running after 4 years even if I decided to delete some of them (like the mail stack), or to replace some services by equivalents (replacement of the Apache2 server by a Nginx server).",
            "technos": [
                "Raspberry",
                "Rasbian",
                "Squid proxy",
                "Bind9",
                "Postfix",
                "Courier",
                "nextcloud",
                "Nginx",
                "Apache2",
                "Wordpress",
                "Letsencrypt"
            ],
            "experience": "Personal",
            "date": "2015"
        },
        {
            "name": "Clémentine",
            "descriptionFr": "Projet de stage de deuxième année en BTS. Mon objectif dans cette mission était de développer des fonctionnalités pour un prototype de chatbot au sein d'Orange. J'ai ainsi pu mettre en place un bon nombre d'APIs (Google translation, Deezer, Page Jaune, Orange APIs...) dans le but d'enrichir les interactions.",
            "descriptionEn": "Second year internship project in BTS. My objective in this mission was to develop functionalities for a chatbot prototype within Orange. I was thus able to set up a good number of APIs (Google translation, Deezer, Yellow Page, Orange APIs...) enriching the possible interactions.",
            "technos": [
                "NodeJs",
                "Microsoft LUIS",
                "Microsoft BotFramework"
            ],
            "experience": "Orange",
            "date": "2016"
        },
        {
            "name": "Oculus",
            "descriptionFr": "Après avoir travaillé sur Clémentine, j'ai essayé de mettre en place une architecture qui me permettrait de créer facilement des Chatbots.",
            "descriptionEn": "After working on Clémentine I tried to set up an architecture that would allow me to easily create Chatbots.",
            "technos": [
                "NodeJs",
                "ExpressJs",
                "MongoDB"
            ],
            "experience": "Personal",
            "date": "2016"
        },
        {
            "name": "Voyager",
            "descriptionFr": "Voyageur est une application Orange qui calcule l'effet d'une relocalisation de centre sur le temps de déplacement des employés qui y travaillent.",
            "descriptionEn": "Voyageur is an Orange application that calculates the effect of a relocation on the travel time of employees who work there.",
            "technos": [
                "TypeScript",
                "Angular",
                "Java",
                "Spring",
                "MongoDB",
                "CloudFoundry"
            ],
            "experience": "Orange",
            "date": "2017"
        },
        {
            "name": "DbSelection",
            "descriptionFr": "Outil pour guider le choix d'une base de données plutôt qu'une autre sur un nouveau projet. Cette application avait beaucoup de visibilité dans mon centre, donc on m'a demandé de faire de nouvelles versions. Il y a donc maintenant dbSelection, dataVizSelection (un équivalent pour choisir un outil dataViz), distribuSelection (un outil pour choisir une distribution BigData) et enfin cloudSelection (un équivalent pour choisir le cloud interne ou externe le plus adapté à notre architecture) qui est devenu une application interne au niveau groupe, avec donc une bonne visibilité.",
            "descriptionEn": "Tool to guide the choice of a database rather than another on a new project. This application had a lot of visibility in my center, so I was asked to make new versions. So there is now dbSelection, dataVizSelection (an equivalent for choosing a dataViz tool), distribSelection (a tool for choosing a BigData distribution) and finally cloudSelection (an equivalent for choosing the internal or external cloud most suited to our architecture) which has become an internal application at group level, therefore with good visibility.",
            "technos": [
                "TypeScript",
                "ExpressJs",
                "Angular",
                "MySQL",
                "CloudFoundry"
            ],
            "experience": "Orange",
            "date": "2018"
        },
        {
            "name": "Girafe",
            "descriptionFr": "Une application pour créer un graphique (Neo4j) de dépendance entre les différents champs d'une base de données (DataLineage). Pour ce faire, l'application prend en entrée les fichiers Microsoft DTSX et analyse les XML et SQL qu'ils contiennent afin de déduire les actions qui sont effectuées sur la base de données. Pour ma part, je me suis principalement concentré sur l'implémentation d'un analyseur SQL utilisant le framework ANTLR.",
            "descriptionEn": "An application to create a graph (Neo4j) of dependency between the different fields of a database (DataLineage). To do this, the application takes Microsoft DTSX files as input and analyzes the XML and SQL they contain in order to deduce the actions that are performed on the database. For my part, I mainly focused on the implementation of a SQL parser using the ANTLR framework.",
            "technos": [
                "Kotlin",
                "Antlr",
                "Neo4j"
            ],
            "experience": "Orange",
            "date": "2019"
        },
        {
            "name": "Sparkle",
            "descriptionFr": "Framework d'analyse de flux de données. L'objectif de ce framework est d'offrir à l'utilisateur la possibilité de développer des modules qui peuvent être placés dans un pipeline de traitement de flux. L'avantage de cette approche modulaire est que chaque module peut ensuite être testé individuellement. Ceci garantit une certaine fiabilité dans notre workflow.",
            "descriptionEn": "Data flow analysis framework. The objective of this framework is to offer the user the possibility to develop modules that can be put in a flow processing pipeline. The advantage of this modular approach is that each module can then be tested individually. This guarantees a certain reliability in our pipeline.",
            "technos": [
                "Java",
                "Vertex",
                "Java 9 Modules",
                "Docker"
            ],
            "experience": "Orange",
            "date": "2019"
        },
        {
            "name": "Personal website",
            "descriptionFr": "Ce site web",
            "descriptionEn": "This website",
            "technos": [
                "TypeScript",
                "VueJs"
            ],
            "experience": "Personal",
            "date": "2019"
        }
    ]
}